update dpdk timer and multi process ipc
